---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamProfileDefinition
source: html/9396dfaa-1fc1-ed85-3611-1d1529fa65a5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamProfileDefinition Property

"Profile Definition"

## Syntax (C#)
```csharp
public static ForgeTypeId FamProfileDefinition { get; }
```